app/controllers/auth_controller.rb

  def register
    user = User.new(sign_up_params)
    if user.save
---
INSERT INTO "users" ("email", "encrypted_password", "reset_password_token", "reset_password_sent_at", "remember_created_at", "created_at", "updated_at", "name", "role") VALUES ('test7@example.com', '$2a$12$F.vgA2LupUTOQ77HYjYDFe/NPu87WPQDFjrVekwhivohXHsuEc5sS', NULL, NULL, NULL, '2025-12-12 04:19:02.063417', '2025-12-12 04:19:02.063417', 'Meeranwe', 'user') RETURNING "id"